Revit 2027 API
BuiltInFailures.AutoRouteFailures.MismatchedSystemClassificationNoSystemWarning Property
 The selected fixture is assigned to a system with different classification.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId MismatchedSystemClassificationNoSystemWarning { get; }
Public Shared ReadOnly Property MismatchedSystemClassificationNoSystemWarning As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ MismatchedSystemClassificationNoSystemWarning {
	FailureDefinitionId^ get ();
}
static member MismatchedSystemClassificationNoSystemWarning : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.AutoRouteFailures Class
Autodesk.Revit.DB Namespace